sulaolab/dspic33ak-hal-starter/src/console/fw_command.c
#include "fw_command.h"

#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <string.h>

#include "dspic33ak_uart.h"
#include "dspic33ak_tick_timer.h"
#include "fw_update.h"
#include "fw_btseq.h"

#define COMMAND_UART               DSPIC33AK_UART_INST_1
#define COMMAND_LINE_CAPACITY      32u
#define COMMAND_MAX_BYTES_PER_POLL 96u
#define RAW_FILE_IDLE_MS           500u

static char     s_line[COMMAND_LINE_CAPACITY];
static uint8_t  s_line_len;
static bool     s_last_was_cr;
static bool     s_quiet;
static bool     s_raw_discard;
static uint32_t s_raw_last_ms;

static void echo_byte(uint8_t c)
{
    (void)dspic33ak_uart_write_byte(COMMAND_UART, c);
}

static void echo_newline(void)
{
    echo_byte((uint8_t)'\r');
    echo_byte((uint8_t)'\n');
}

static char ascii_lower(char c)
{
    if ((c >= 'A') && (c <= 'Z')) {
        return (char)(c + ('a' - 'A'));
    }
    return c;
}

static void line_reset(void)
{
    s_line_len = 0u;
    s_line[0] = '\0';
}

static const char *update_status_name(fw_update_status_t status)
{
    switch (status) {
    case FW_UPDATE_OK:           return "ok";
    case FW_UPDATE_ERR_XMODEM:   return "xmodem";
    case FW_UPDATE_ERR_NVM:      return "flash";
    case FW_UPDATE_ERR_OVERFLOW: return "image too large";
    case FW_UPDATE_ERR_IMAGE_FORMAT: return "wrong reflash image format";
    case FW_UPDATE_ERR_IMAGE_CRC:    return "reflash image crc";
    case FW_UPDATE_ERR_READBACK: return "read-back crc";
    default:                     return "unknown";
    }
}

static const char *commit_status_name(fw_commit_status_t status)
{
    switch (status) {
    case FW_COMMIT_OK:               return "ok";
    case FW_COMMIT_ERR_NOT_VERIFIED: return "no validated image";
    case FW_COMMIT_ERR_WRAP:         return "boot sequence exhausted";
    case FW_COMMIT_ERR_NVM:          return "flash";
    case FW_COMMIT_ERR_VERIFY:       return "boot sequence read-back";
    case FW_COMMIT_ERR_ROLLBACK:     return "boot sequence rollback";
    case FW_COMMIT_ERR_UCA:          return "inactive partition config";
    default:                         return "unknown";
    }
}

static void print_receive_result(const fw_update_result_t *result)
{
    if (result->status == FW_UPDATE_OK) {
        printf("\r\nFirmware receive: PASS\r\n");
        printf("  bytes        : %lu\r\n", (unsigned long)result->bytes_rx);
        printf("  pages erased : %lu\r\n", (unsigned long)result->pages_erased);
        printf("  rows written : %lu\r\n", (unsigned long)result->rows_programmed);
        printf("  image crc    : %04X\r\n", (unsigned)result->img_crc);
        printf("  read-back crc: %04X\r\n", (unsigned)result->readback_crc);
        printf("  package crc  : %04X\r\n", (unsigned)result->package_crc);
        printf("Validation: PASS (DBFW manifest + xmodem-crc + flash read-back)\r\n");
        printf("Type *fca5 to activate the validated partition.\r\n");
        return;
    }

    printf("\r\nFirmware receive: FAIL (%s, wrec=%02X)\r\n",
           update_status_name(result->status), (unsigned)result->last_wrec);
    if (result->status == FW_UPDATE_ERR_XMODEM) {
        printf("Use Tera Term: File > Transfer > XMODEM > Send.\r\n");
        printf("Do not use File > Send file. Type *fua5 to retry.\r\n");
    } else if ((result->status == FW_UPDATE_ERR_IMAGE_FORMAT) ||
               (result->status == FW_UPDATE_ERR_IMAGE_CRC)) {
        printf("Send reflash_image.bin generated by this project's build.ps1.\r\n");
        printf("Use Tera Term XMODEM Send with 1K unchecked.\r\n");
        printf("The inactive partition was not validated; *fca5 is blocked.\r\n");
    } else {
        printf("The inactive partition was not validated; *fca5 is blocked.\r\n");
    }
}

static void receive_firmware(void)
{
    fw_update_result_t result;

    /* This remains set after the transfer so no heartbeat/terminal-reset text
     * can appear while the beginner reads the validation result and types
     * *fca5. A reset after commit restores normal output. */
    s_quiet = true;
    printf("\r\nFirmware update armed.\r\n");
    printf("Tera Term: File > Transfer > XMODEM > Send\r\n");
    printf("Select reflash_image.bin with 1K unchecked.\r\n");
    printf("Waiting for xmodem-crc data on UART1...\r\n");

    (void)fw_update_receive(&result);
    print_receive_result(&result);
}

static void commit_firmware(void)
{
    fw_commit_status_t status;

    if (!fw_update_receive_verified()) {
        printf("\r\nCommit refused: no validated image. Run *fua5 first.\r\n");
        return;
    }

    printf("\r\nCommitting validated partition; the board will reset...\r\n");
    status = fw_commit();

    /* Success resets and never returns. */
    if (status == FW_COMMIT_ERR_ROLLBACK) {
        printf("Commit failed: %s. Do not reset or power-cycle; service is required.\r\n",
               commit_status_name(status));
    } else {
        printf("Commit failed: %s. Current partition remains selected.\r\n",
               commit_status_name(status));
        if (status == FW_COMMIT_ERR_UCA) {
            printf("Flash a newly verified production.bundle.hex before retrying.\r\n");
        } else if (status == FW_COMMIT_ERR_WRAP) {
            printf("BTSEQ generations are exhausted; PKOB4 service is required.\r\n");
        } else {
            printf("Run *fua5 and transfer reflash_image.bin again before retrying.\r\n");
        }
    }
}

static void process_line(void)
{
    uint8_t i;

    s_line[s_line_len] = '\0';
    for (i = 0u; i < s_line_len; i++) {
        s_line[i] = ascii_lower(s_line[i]);
    }

    if (s_line_len == 0u) {
        return;
    }
    if (strcmp(s_line, "*fua5") == 0) {
        receive_firmware();
        return;
    }
    if (strcmp(s_line, "*fca5") == 0) {
        commit_firmware();
        return;
    }
    if ((strcmp(s_line, "*fu") == 0) || (strcmp(s_line, "*fc") == 0)) {
        printf("Command is not armed. Use *fua5 or *fca5.\r\n");
        return;
    }

    printf("Unknown command. Firmware update commands: *fua5, *fca5\r\n");
}

static void begin_raw_file_discard(void)
{
    line_reset();
    s_raw_discard = true;
    s_raw_last_ms = dspic33ak_tick_timer_get_ms();
    printf("\r\nWARNING: plain file data was detected and discarded.\r\n");
    printf("Do not use Tera Term File > Send file.\r\n");
    printf("Type *fua5, then use File > Transfer > XMODEM > Send.\r\n");
}

static void feed_normal_byte(uint8_t c)
{
    if ((c == (uint8_t)'\r') || (c == (uint8_t)'\n')) {
        if ((c == (uint8_t)'\n') && s_last_was_cr) {
            s_last_was_cr = false;
            return;
        }
        s_last_was_cr = (c == (uint8_t)'\r');
        echo_newline();
        process_line();
        line_reset();
        return;
    }

    s_last_was_cr = false;

    if ((c == 0x08u) || (c == 0x7Fu)) {
        if (s_line_len > 0u) {
            s_line_len--;
            s_line[s_line_len] = '\0';
            echo_byte(0x08u);
            echo_byte((uint8_t)' ');
            echo_byte(0x08u);
        }
        return;
    }

    if ((c < 0x20u) || (c > 0x7Eu)) {
        begin_raw_file_discard();
        return;
    }

    if (s_line_len >= (COMMAND_LINE_CAPACITY - 1u)) {
        begin_raw_file_discard();
        return;
    }

    s_line[s_line_len++] = (char)c;
    s_line[s_line_len] = '\0';
    echo_byte(c);
}

void fw_command_init(void)
{
    line_reset();
    s_last_was_cr = false;
    s_quiet = false;
    s_raw_discard = false;
    s_raw_last_ms = 0u;
}

bool fw_command_quiet(void)
{
    return s_quiet || s_raw_discard;
}

void fw_command_poll(void)
{
    uint8_t data;
    uint8_t count = 0u;
    bool received = false;

    while ((count < COMMAND_MAX_BYTES_PER_POLL) &&
           dspic33ak_uart_rx_ready(COMMAND_UART)) {
        if (dspic33ak_uart_read_byte(COMMAND_UART, &data) != DSPIC33AK_UART_OK) {
            break;
        }
        count++;
        received = true;

        if (s_raw_discard) {
            s_raw_last_ms = dspic33ak_tick_timer_get_ms();
            continue;
        }
        feed_normal_byte(data);
    }

    if (s_raw_discard && !received &&
        ((uint32_t)(dspic33ak_tick_timer_get_ms() - s_raw_last_ms) >= RAW_FILE_IDLE_MS)) {
        dspic33ak_uart_rx_flush(COMMAND_UART);
        s_raw_discard = false;
        s_last_was_cr = false;
        printf("Plain file input cleared. Ready for *fua5.\r\n");
    }
}
